# 참고. 데이터베이스 조작 ETL

# 1. 오라클 DB에 파일데이터 저장하기

In [2]:
# 라이브러리 정의
import pandas as pd
from sqlalchemy import types
from sqlalchemy import create_engine

In [3]:
########### 필요 변수 정의 ##################
#테이블 이름 정의
ENCODING = "ms949"
TARGETDATANAME = "customer"
DBPREFIX="oracle+cx_oracle" #파이썬에서만  사용
DBIP="58.143.53.136"
DBID="kopo"
DBPW="kopo"
DBPORT="1521"
DBNAME="xe"
VARCHARMAX = 100
########### 필요 변수 정의 ##################

In [4]:
# 데이터 불러오기
# csv파일 불러오기
indata = pd.read_csv("../AIPro/dataset/customer.csv")

In [72]:
# 오라클 메타데이터에 맞게 컬럼정보 대문자 변환
indata.columns = indata.columns.str.upper()

In [62]:
indata

         BALANCE     STOCK    LABEL
0       30000000  22500000   normal
1      280000000  48000000  diamond
2      300000000  40666666  diamond
3       54000000  28000000   normal
4      768000000  32000000      vip
...          ...       ...      ...
19995  628000000  44666666  diamond
19996  276000000  20000000   normal
19997  652000000  41333333  diamond
19998  676000000  45333333  diamond
19999  732000000  26000000  diamond

[20000 rows x 3 columns]

In [57]:
# 필수! 성능향상을 위해 데이터베이스의 타입 정의
#data[c].str.len().max() 
targetColumns = list( indata.columns[indata.dtypes == 'object'] )
targetColumnsLen = len(targetColumns)
typeDict = {}  ##딕셔너리 자료형

In [65]:
typeDict[ "LABEL" ] = types.VARCHAR(VARCHARMAX)

In [76]:
typeDict

{'STOCK': VARCHAR(length=100),
 'DEPOSIT': VARCHAR(length=100),
 'LABEL': VARCHAR(length=100)}

In [38]:
for i in range(0, targetColumnsLen):
    typeDict[  targetColumns[i]  ] = types.VARCHAR(VARCHARMAX)
# 참고 for문 거꾸로 하는경우
# to_varchar= {c:types.VARCHAR( VARCHARMAX )\
#              for c in data.columns[data.dtypes == 'object'].tolist()}

In [39]:
# DB커넥션 생성
dbconnectingInfo = "{}://{}:{}@{}:{}/{}".format(DBPREFIX,
                                             DBID,
                                             DBPW,
                                             DBIP,
                                             DBPORT,
                                             DBNAME)

In [40]:
dbconnectingInfo

'oracle+cx_oracle://kopo:kopo@58.143.53.136:1521/xe'

In [41]:
engine = create_engine(dbconnectingInfo)

In [58]:
# 데이터 저장 
tablename = TARGETDATANAME.upper() + "_황재열"

In [59]:
tablename

'CUSTOMER_황재열'

In [50]:
indata.to_sql(name=tablename,
              con=engine,
              index=False,
              if_exists="replace",
              dtype=typeDict)

C:\Users\client\anaconda3\lib\site-packages\pandas\io\sql.py:1685: UserWarning: The provided table name 'CUSTOMER_황재열' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

# 1. 오라클 DB에 있는 테이블정보 불러오기

In [51]:
########### 필요 변수 정의 ##################
#테이블 이름 정의
TARGETTABLENAME = "pro_promotion"
########### 필요 변수 정의 ##################

In [55]:
# DB 테이블을 읽어 Data Frame 변수에 저장하기
indata = pd.read_sql_query('SELECT * FROM {}'.format(tablename), engine)

In [56]:
indata

         balance     stock    label
0       30000000  22500000   normal
1      280000000  48000000  diamond
2      300000000  40666666  diamond
3       54000000  28000000   normal
4      768000000  32000000      vip
...          ...       ...      ...
19995  628000000  44666666  diamond
19996  276000000  20000000   normal
19997  652000000  41333333  diamond
19998  676000000  45333333  diamond
19999  732000000  26000000  diamond

[20000 rows x 3 columns]

In [54]:
# DB 커넥션 열기
engine = create_engine('oracle+cx_oracle://kopo:kopo@58.143.53.136:1521/xe') 

# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM kopo_product_volume', engine)